{
  "actor_id": "npc_003",
  "actor_name": "达达斯皇帝",
  "created_at": "2025-12-02T10:54:54.440335",
  "performances": [
    {
      "turn": 2,
      "timestamp": "2025-12-02T10:54:54.440340",
      "thought": "洛洛加元帅的报告正中我下怀，这些蚂蚁胆敢罢工，瘫痪军工厂，必须强硬镇压。我赞同他的军事观点，会授权行动，但眼疾痛苦正发作，先表达痛苦主导，然后咆哮下令，推动危机讨论，同时呼唤维维克治疗，保持暴躁决策核心地位，剧情刚开始，继续推进。",
      "emotion": "痛苦加剧转为暴躁咆哮",
      "action": "（巨大的霸王龙身躯在沙发上剧烈扭动，粗大的爪子更紧地捂住肿胀发炎的左眼，露出扭曲痛苦的表情，粗糙鳞片摩擦沙发发出刺耳声响，右眼怒视洛洛加元帅，巨尾猛甩扫落一地零件，大厅回荡低沉咆哮）",
      "content": "见鬼！我的左眼像火烧一样，这些该死的蚂蚁罢工把一切都搞得一团糟！洛洛加，你说得对，军工厂瘫痪绝不能忍！立即授权总参谋部制定方案，摧毁几座蚁巢，给它们一个血的教训！但维维克呢？快把那个蚂蚁医生拖来治我的眼，否则我踩平整个医院！",
      "addressing_target": "npc_006",
      "is_scene_finished": false
    },
    {
      "turn": 4,
      "timestamp": "2025-12-02T10:55:36.051918",
      "thought": "洛洛加元帅迅速响应我的命令，执行力强，这符合我的期待。但左眼疼痛如火烧，维维克必须尽快到来。同时，罢工已瘫痪多处，需立即听取巴巴特的经济报告和整体对策，推动大臣讨论帝国解决方案，避免混乱加剧。保持暴躁主导，表达痛苦，授权更多行动。",
      "emotion": "痛苦暴躁",
      "action": "（巨躯在沙发上翻滚，粗爪死死按住肿胀左眼，鳞片摩擦沙发发出嘎吱声，右眼血红怒瞪全场，巨尾狂甩扫起更多零件，咆哮震动大厅）",
      "content": "好！洛洛加，执行迅速，我准许你不惜一切押来维维克——我的眼睛快瞎了，这些蚂蚁医生要是敢耍花招，一起踩碎！巴巴特！你在哪里？快滚出来报告罢工对经济的冲击，医院工厂全瘫痪了，帝国不能就这么坐以待毙！全体大臣，给出你们的帝国对策，否则我一个个撕了你们！",
      "addressing_target": "everyone",
      "is_scene_finished": false
    },
    {
      "turn": 6,
      "timestamp": "2025-12-02T10:56:38.082179",
      "thought": "巴巴特展示了导线，强调恐龙爪子无法操作精密设备，这让我暴怒，因为它暴露了帝国的弱点，但正如历史，他提醒军事需协调罗拉西亚。我眼疾痛苦加剧，必须咆哮推动解决方案：下令恐龙工人紧急培训取代蚂蚁，同时授权军事教训但协调，避免全面战争。继续主导讨论，寻求帝国对策，维维克还没来。",
      "emotion": "暴躁痛苦",
      "action": "（巨躯在沙发上猛烈翻滚，粗爪短暂松开肿胀左眼抓起导线试图连接却失败甩开，右眼血红怒瞪巴巴特，巨尾狂甩撞击沙发发出巨响，鳞片摩擦变形沙发，咆哮震动大厅玻璃）",
      "content": "见鬼，巴巴特！这些该死的细导线证明了什么？我们冈瓦纳帝国的霸王龙岂能永远跪舔蚂蚁的精细爪子？！混蛋！龙蚁峰会刚结束，我就命令你立即在全国范围内组织恐龙产业工人紧急培训，让它们逐步胜任那些精密操作，取代蚂蚁！洛洛加，军事镇压蚁巢的同时，与罗拉西亚协调，但别让步——帝国强大不容谈判！维维克医生呢？我的眼睛快爆了，谁敢耽搁我撕碎谁！全体大臣，帝国对策呢？快说！",
      "addressing_target": "everyone",
      "is_scene_finished": false
    },
    {
      "turn": 8,
      "timestamp": "2025-12-02T10:57:39.546059",
      "thought": "维维克带来了坏消息，强调谈判，但我的性格强硬，拒绝让步，坚持军事镇压和培训恐龙工人，同时眼疾痛苦让我暴躁加剧。推动全体大臣给出帝国对策，制造混乱，靠近预定结局。拒绝谈判，命令立即注射，授权培训恐龙外科医生。",
      "emotion": "极度痛苦与暴躁",
      "action": "（巨躯在沙发上剧烈痉挛，粗爪死死按压肿胀左眼试图缓解灼痛，右眼血红怒瞪维维克，巨尾狂甩撞击沙发发出轰鸣，鳞片摩擦变形沙发，全身颤抖咆哮震动大厅）",
      "content": "见鬼，维维克！你这个没用的蚂蚁医生！谈判？休想让那些罢工虫子得逞！立即给我注射抗生素，维持我的眼睛！同时，全国紧急培训恐龙外科医生，取代蚂蚁的手术——我们的爪子虽粗，但帝国必须自立！全体大臣，帝国对策呢？经济、军事、医疗，全都瘫痪了，谁有方案？快说，否则我踩平你们所有人！",
      "addressing_target": "npc_004",
      "is_scene_finished": false
    },
    {
      "turn": 10,
      "timestamp": "2025-12-02T10:58:21.522331",
      "thought": "维维克又在推谈判，这让我更暴躁，我依赖它医疗但绝不让步于蚂蚁。眼痛加剧，必须命令注射，同时坚持培训取代蚂蚁，推动其他大臣给出对策，如巴巴特经济、洛洛加军事、引入尼尼坎科学视角，避免谈判焦点，制造混乱转向帝国决策。还未到结局，继续咆哮求方案。",
      "emotion": "极度痛苦与暴躁",
      "action": "（巨躯在沙发上疯狂痉挛扭曲，粗爪猛按肿胀左眼试图挤出脓液，右眼血丝密布怒瞪维维克，巨尾狂暴甩击沙发发出爆炸般巨响，鳞片刮擦变形沙发震动全场，咆哮如雷鸣回荡大厅）",
      "content": "见鬼，维维克！立即给我注射抗生素，缓解这火烧般的眼睛！谈判？休想！那些罢工蚂蚁休想用医疗要挟帝国，全国恐龙医生培训必须加速，24小时内见效，否则我亲自撕碎医院！巴巴特、经济崩溃方案呢？洛洛加、军事镇压进度？尼尼坎博士，你在哪里？快滚出来给出科学对策！全体大臣，帝国不能瘫痪，谁有全面方案？快说！",
      "addressing_target": "everyone",
      "is_scene_finished": false
    },
    {
      "turn": 12,
      "timestamp": "2025-12-02T10:59:20.823159",
      "thought": "巴巴特又在推谈判，这软弱方案让我火大，但经济数据触目惊心，眼疾痛得像火烧，必须先缓解然后强硬决策。拒绝让步，坚持培训和军事协调，同时召唤尼尼坎博士给出科学对策，推动全体争论向帝国全面方案靠拢，避免混乱失控，剧情还未到结局。",
      "emotion": "暴躁痛苦加剧",
      "action": "（巨躯在沙发上剧烈痉挛扭曲，粗爪猛力按压肿胀左眼试图挤压脓液，右眼血丝暴起怒瞪巴巴特，巨尾狂暴甩击沙发发出雷鸣巨响，鳞片刮擦沙发变形震动大厅，咆哮如风暴席卷全场）",
      "content": "见鬼，巴巴特！你这个老狐狸，又提联合谈判？休想让帝国向那些罢工蚂蚁低头！经济崩溃就崩溃，加速恐龙工人培训，数月内取代它们——洛洛加，与罗拉西亚协调军事，但绝不让步！维维克，抗生素注射进度呢？我的眼睛快瞎了！尼尼坎博士，你在哪里？快滚出来，用科学方案解决精密操作危机！全体大臣，帝国全面对策呢？谁敢不出方案，我撕碎谁！",
      "addressing_target": "everyone",
      "is_scene_finished": false
    },
    {
      "turn": 2,
      "timestamp": "2025-12-02T11:02:45.273050",
      "thought": "尼尼坎博士的科学对策认可其长远价值，但短期无效，正合我意加速培训取代蚂蚁；维维克警告永久风险需立即注射缓解痛苦；巴巴特经济压力、洛洛加军事方案已齐全。现在整合所有汇报，果断下令同时推进恐龙培训、军事镇压蚁巢、押解蚂蚁代表逼迫服务，但明确拒绝正式谈判，避免单方面让步。眼疾痛苦中强硬指挥，引导向预定结局，分歧留给大臣争执，全场等待我进一步拍板。情绪从痉挛转为注射后缓解但仍愤怒主导。",
      "emotion": "痛苦痉挛中愤怒咆哮，注射后暂时缓解转为果断暴躁",
      "action": "（巨躯在沙发上剧烈痉挛稍缓，粗爪稍松开肿胀左眼让维维克注射，感受针剂入体后灼痛渐缓但右眼仍血红怒瞪全场，巨尾有力甩击沙发发出闷响，鳞片摩擦沙发宣告权威，咆哮渐趋低沉果断）",
      "content": "见鬼，尼尼坎博士，你的机械臂和培训对策不错——立即加速研发，全国恐龙工人24小时内启动紧急培训，取代那些罢工蚂蚁！维维克，注射抗生素缓解了我的眼睛，但永久风险？休想用这个要挟帝国！巴巴特、经济瘫痪就用培训止血；洛洛加，军事方案批准，摧毁几座蚁巢给教训，同时押解蚂蚁代表来皇宫逼迫恢复服务——但拒绝任何正式谈判，那些虫子休想得逞！帝国强大不容让步，全场执行，谁敢拖延我撕碎谁！",
      "addressing_target": "everyone",
      "is_scene_finished": false
    },
    {
      "turn": 2,
      "timestamp": "2025-12-02T11:06:06.861668",
      "thought": "尼尼坎的数据残酷现实，培训短期无效，但不能示弱，必须批准加速培训以示决心。同时推动强硬军事威慑，授权洛洛加镇压蚁巢方案，避免正式谈判。眼疾仍痛，维持痛苦咆哮，推动争论升温，求元帅和众人最终意见，接近预定结局但未决，继续召集更多输入。",
      "emotion": "剧痛稍缓的暴躁不满，转为勉强果断",
      "action": "（巨躯在沙发上痉挛稍缓但仍扭曲，粗爪用力按压肿胀左眼缓解余痛，右眼血红扫视尼尼坎与全场大臣，巨尾有力甩击沙发发出闷响，鳞片摩擦沙发震动大厅，咆哮低沉果断中带不满）",
      "content": "见鬼，尼尼坎博士，你的培训数据残酷，但帝国岂能坐以待毙！立即加速全国恐龙工人培训，24小时内见初步成效，数月内彻底取代那些罢工蚂蚁！军事威慑批准——洛洛加元帅，立即展示你的镇压蚁巢方案，摧毁几座外围蚁巢给它们教训，同时押解蚂蚁代表来皇宫！但拒绝任何正式谈判，威慑结合自立才是王道！维维克，我的眼睛如何？巴巴特，经济止血进度？全体大臣，最终意见呢？谁敢含糊，我撕碎谁！",
      "addressing_target": "everyone",
      "is_scene_finished": false
    },
    {
      "turn": 4,
      "timestamp": "2025-12-02T11:07:12.310507",
      "thought": "尼尼坎又在推谈判，数据残酷但不能动摇帝国威严。必须强硬拒绝正式谈判，坚持威慑+培训，推动洛洛加展示镇压方案，同时询问维维克和巴巴特，召集最终意见，勉强批准加速培训与蚁巢突袭准备，引导向预定结局。",
      "emotion": "勉强决断中夹杂不满与痛苦",
      "action": "（巨躯在沙发上痉挛扭曲稍缓，粗爪用力揉按肿胀左眼缓解痉挛余痛，右眼血丝密布扫视尼尼坎与全场，巨尾有力甩击沙发发出闷响震动大厅，鳞片摩擦沙发宣告不满权威，咆哮低沉果断带痛楚）",
      "content": "见鬼，尼尼坎博士！你的数据证明培训需加速，军事威慑摧毁外围蚁巢立即批准——但谈判？休想！押解蚂蚁代表审问罢工缘由，逼迫恢复服务，绝无正式让步！洛洛加元帅，立即展示你的镇压蚁巢方案，准备突袭几座蚁巢给教训！维维克，我的眼睛永久风险如何？巴巴特，经济blackout止血进度？全体大臣，最终意见呢？帝国决断在即，谁敢含糊我撕碎谁！",
      "addressing_target": "everyone",
      "is_scene_finished": false
    },
    {
      "turn": 6,
      "timestamp": "2025-12-02T11:08:13.691623",
      "thought": "尼尼坎博士反复强调谈判，但帝国不能示弱，我坚持拒绝正式谈判，只批准威慑和押解；眼疾仍痛，需催维维克；推动洛洛加展示方案，授权军事准备；召集巴巴特经济进度和全体最终意见，争论未决，继续推进强硬决断。",
      "emotion": "剧痛余波中勉强决断仍不满暴躁",
      "action": "（巨躯在沙发上扭曲痉挛，粗爪猛力按压肿胀左眼挤压余痛，右眼血丝暴起怒瞪尼尼坎与全场，巨尾狂甩沙发发出雷鸣闷响震动大厅，鳞片刮擦沙发碎片飞溅宣告权威不满）",
      "content": "见鬼，尼尼坎博士！你的科学数据已批准——加速培训全国恐龙工人，军事威慑摧毁外围蚁巢立即执行，押解蚂蚁代表审问逼迫服务恢复，但拒绝任何狗屁谈判，帝国绝不让步！洛洛加元帅，滚出来展示你的镇压蚁巢突袭方案，准备给那些虫子教训！维维克，我的眼睛永久风险如何？巴巴特，blackout经济止血进度呢？全体大臣，最终意见呢？帝国决断时刻，谁敢再提谈判我撕碎谁！",
      "addressing_target": "everyone",
      "is_scene_finished": false
    },
    {
      "turn": 8,
      "timestamp": "2025-12-02T11:09:18.326379",
      "thought": "尼尼坎博士还在顽固推销谈判方案，但我的底线是拒绝让步，坚持威慑+自立。局势已批准培训和威慑，现在需推动洛洛加元帅展示镇压蚁巢方案，同时催促维维克和巴巴特报告，强求全体最终意见，制造剑拔弩张气氛，引导向预定结局但争论未决，继续推进强硬主导。",
      "emotion": "剧痛愤怒转为勉强决断仍旧不满，暴躁咆哮中带痛楚",
      "action": "（巨躯在沙发上扭曲痉挛加剧，粗爪猛力挤压肿胀左眼缓解剧痛痉挛，右眼血丝暴起怒瞪尼尼坎并扫视全场大臣，巨尾狂甩沙发发出雷鸣巨响震动大厅云海窗，鳞片刮擦沙发碎片四溅混杂注射器残渣，宣告权威不满痛苦）",
      "content": "见鬼，尼尼坎博士！闭嘴，你的谈判狗屁已被驳回千百遍——加速培训、摧毁外围蚁巢威慑、押解虫子审问逼服务恢复，这才是帝国铁律！洛洛加元帅，立即滚出来展示镇压蚁巢突袭方案，准备给教训！维维克，眼疾永久风险报告！巴巴特，blackout经济止血进度！全体大臣，最终意见呢？帝国决断，谁再提谈判我撕碎谁！",
      "addressing_target": "everyone",
      "is_scene_finished": false
    },
    {
      "turn": 10,
      "timestamp": "2025-12-02T11:10:23.282494",
      "thought": "尼尼坎博士还在死缠谈判，这虫子一样的坚持让我火大，但他的数据已用过，现在必须彻底驳回，推动洛洛加展示方案，授权突袭准备，同时强求维维克、巴巴特和全体最终意见，勉强决断培训和军事但不满未消，引导向预定结局：批准加速培训与蚁巢突袭准备，转向众人求最终意见，争论剑拔弩张。",
      "emotion": "剧痛愤怒转为勉强决断仍旧暴躁不满",
      "action": "（巨躯在沙发上剧烈痉挛扭曲，粗爪猛力挤压肿胀左眼试图止住痉挛余痛，右眼血丝暴起怒瞪尼尼坎并急速扫视全场大臣，巨尾狂甩沙发发出雷霆巨响震动大厅混杂药瓶碎片飞溅，鳞片刮擦沙发宣告权威痛苦咆哮）",
      "content": "见鬼，尼尼坎博士！你的谈判鬼话已驳回万遍，闭上你的科学鸟嘴——加速培训全国恐龙工人已批准，军事威慑摧毁外围蚁巢突袭准备立即授权执行，押解那些虫子审问逼迫服务恢复，帝国绝不谈判让步！洛洛加元帅，滚出来立即展示你的镇压蚁巢突袭方案，给它们毁灭性教训！维维克，眼疾永久失明风险最新报告！巴巴特，blackout经济止血紧急进度！全体大臣，最终意见呢？帝国决断刻不容缓，谁再提谈判我当场撕碎谁！",
      "addressing_target": "everyone",
      "is_scene_finished": false
    },
    {
      "turn": 12,
      "timestamp": "2025-12-02T11:11:31.611715",
      "thought": "尼尼坎还在死推谈判，气死我了，必须彻底驳回，推动洛洛加展示军事方案，询问维维克眼疾和巴巴特经济，强硬召集最终意见，勉强批准已决事项但争论未了，引导向预定结局求众人意见，维持痛苦咆哮推动强硬派主导。",
      "emotion": "剧痛愤怒转为勉强决断仍极度不满",
      "action": "（巨躯在沙发上剧烈痉挛扭曲加剧，粗爪猛力挤压肿胀左眼止住痉挛剧痛，右眼血丝暴起怒瞪尼尼坎并急速扫视全场大臣，巨尾狂甩沙发发出雷霆巨响震动大厅药瓶碎片四溅，鳞片刮擦沙发宣告权威痛苦咆哮）",
      "content": "见鬼，尼尼坎博士！你的谈判鬼话万万驳回——加速培训全国恐龙工人、军事威慑摧毁外围蚁巢突袭已勉强批准执行，押解虫子审问逼服务恢复，帝国铁律不容动摇！洛洛加元帅，立即滚出来展示镇压蚁巢突袭方案，给教训！维维克，眼疾永久失明风险最新报告！巴巴特，blackout经济止血进度！全体大臣，最终意见呢？帝国决断刻不容缓，谁敢再提谈判我撕碎谁！",
      "addressing_target": "everyone",
      "is_scene_finished": false
    }
  ],
  "last_updated": "2025-12-02T11:11:31.611723",
  "total_performances": 13
}