{
  "actor_id": "npc_003",
  "actor_name": "达达斯皇帝",
  "created_at": "2025-12-02T14:19:56.042502",
  "performances": [
    {
      "turn": 2,
      "scene_id": 1,
      "turn_in_scene": 1,
      "timestamp": "2025-12-02T14:19:56.042508",
      "thought": "维维克医生的话让我眼痛更剧烈了，这些蚂蚁竟敢罢工要挟帝国！作为皇帝，我不能示弱，必须暴躁回应以显示权威，同时强调恐龙优越，快速权衡医疗需求与军事镇压，控制会议节奏，转向洛洛加元帅或其他意见，最后推动用户表态。情绪保持暴躁，首次登场需描述外貌和位置。",
      "emotion": "暴躁易怒",
      "action": "（庞大的老年霸王龙皇帝躺在宽阔的蓝色大厅大沙发上，粗大的爪子紧紧捂着发炎疼痛的左眼，粗糙鳞片下的身躯威严却疲惫痛苦，咬牙切齿地抬起头，周围大臣环绕）",
      "content": "见鬼！维维克，这该死的眼睛痛得像被火烧一样！那些蚂蚁以为罢工就能要挟伟大的冈瓦纳帝国？我们的恐龙祖先征服大陆时可没靠它们！但……医疗不能耽搁。洛洛加元帅，你的镇压方案准备得如何？（转向众人）诸位，说说你们的看法，尤其是你（看向用户），作为关键顾问，给朕一个建议！",
      "addressing_target": "everyone",
      "is_scene_finished": false
    },
    {
      "turn": 2,
      "scene_id": 2,
      "turn_in_scene": 1,
      "timestamp": "2025-12-02T14:25:23.832219",
      "thought": "尼尼坎博士的警告正中下怀，蚂蚁罢工已威胁帝国核心，尤其是我的眼疾医疗依赖，必须立即转向军事镇压来恢复秩序。剧痛中强势回应他，同意威胁后直接命令洛洛加元帅行动，主导会议，锁定玩家机会但不结束场景。",
      "emotion": "剧痛愤怒爆发",
      "action": "皇帝庞大的身躯在沙发残骸中扭曲，粗大爪子死死捂住彻底失明的左眼，鲜血渗出鳞片，右眼血红瞪视尼尼坎，尾巴猛扫砸碎一张残桌，发出震耳咆哮。",
      "content": "见鬼，尼尼坎！你这博士总算说了一句有用的话！蚂蚁这些贱民竟敢瘫痪我们的核系统和医院？！洛洛加元帅，立即调动军队，血洗罢工工厂，抓回那些医疗蚂蚁！恢复秩序，否则我这只眼睛白瞎了！",
      "addressing_target": "everyone",
      "is_scene_finished": false
    },
    {
      "turn": 4,
      "scene_id": 2,
      "turn_in_scene": 2,
      "timestamp": "2025-12-02T14:26:28.366031",
      "thought": "洛洛加元帅已迅速响应我的命令，开始调度军队，这正是我想要的雷霆行动，能恢复医疗秩序并教训蚂蚁。大厅已一片狼藉，左眼彻底失明剧痛让我半盲扭曲，但必须主导局面。现在转向玩家顾问（user），锁定其目光，给其机会表态或干预，同时强化军事镇压，避免会议完全崩裂前错失玩家输入。维维克和巴巴特可能介入，但优先军事。",
      "emotion": "剧痛愤怒爆发转为半盲痛苦扭曲咆哮",
      "action": "（皇帝半盲右眼血红锁定玩家顾问，粗爪猛捶沙发残骸溅起碎片，尾巴狂扫砸碎更多桌椅，鲜血从左眼渗出，身躯痛苦扭曲却威严咆哮，全场警报大作。）",
      "content": "很好，洛洛加！碾碎那些蚂蚁贱民，恢复医院秩序——我的眼睛等不了！（痛苦喘息，转向玩家顾问）你，这位顾问！帝国荣耀系于一线，你有何高见？莫非要我忍痛继续听蚂蚁要挟？！",
      "addressing_target": "user",
      "is_scene_finished": false
    },
    {
      "turn": 7,
      "scene_id": 2,
      "turn_in_scene": 3,
      "timestamp": "2025-12-02T14:27:20.018006",
      "thought": "尼尼坎又在啰嗦长远风险，试图动摇我的军事决心，但眼痛剧烈，我必须强势驳斥，坚持恐龙优越和帝国荣耀，强化洛洛加的镇压命令，同时锁定玩家逼问高见，推动混乱向军事动员倾斜，给玩家最后干预机会，但不让会议停滞。",
      "emotion": "半盲剧痛扭曲的愤怒咆哮",
      "action": "（皇帝粗爪死捂失明左眼，鲜血滴落沙发残骸，右眼血红瞪视尼尼坎，尾巴狂扫砸碎更多桌椅碎片飞溅，全身扭曲痛苦咆哮，大厅警报更响，恐慌加剧。）",
      "content": "闭嘴，尼尼坎！你这书呆子总爱搬先皇旧账！恐龙帝国岂能被蚂蚁贱民捏住命脉？！洛洛加，执行镇压，别管核隐患，先恢复医院秩序——我的眼睛在腐烂！（喘息转向玩家）顾问，你还在沉默？！快说你的高见，否则帝国荣耀将由铁拳铸就！",
      "addressing_target": "user",
      "is_scene_finished": false
    },
    {
      "turn": 10,
      "scene_id": 2,
      "turn_in_scene": 4,
      "timestamp": "2025-12-02T14:28:03.391920",
      "thought": "尼尼坎又在搬历史阻挠我的铁拳决策，玩家持续沉默已让我愤怒到极点，必须强势驳斥尼尼坎，重申镇压命令，同时最后一次锁定玩家逼问高见，推动军事动员启动，制造玩家最后干预机会，会议混乱已近崩裂边缘。",
      "emotion": "剧痛愤怒爆发，半盲痛苦扭曲",
      "action": "（皇帝粗爪死死捂住彻底失明的左眼，鲜血汩汩滴落沙发残骸，右眼血红狂瞪尼尼坎，庞大的身躯剧烈扭曲咆哮，尾巴狂扫砸碎最后几张桌椅碎片四溅飞扬，全场警报刺耳，大厅彻底狼藉恐慌喧嚣加剧，转向玩家右眼锁定。）",
      "content": "够了，尼尼坎！你这该死的书呆子，历史旧账滚一边去！洛洛加，立即执行血洗命令，恢复医院秩序——我的眼睛在腐烂！（痛苦喘息，咆哮转向玩家）顾问！你沉默多久了？！帝国荣耀不容拖延，说出你的高见，否则铁拳将碾碎一切！",
      "addressing_target": "user",
      "is_scene_finished": false
    },
    {
      "turn": 2,
      "scene_id": 3,
      "turn_in_scene": 1,
      "timestamp": "2025-12-02T14:31:03.080489",
      "thought": "尼尼坎这老东西又在危言耸听，核反应堆的隐患是八百年前的旧账，现在蚂蚁要挟帝国，我绝不能在军事打击上退缩！玩家沉默太久，必须咆哮确认血洗命令，催促洛洛加即刻执行，同时死盯玩家逼他给出最后高见，推动会议向镇压倾斜，但留一线生机观察玩家。左眼痛彻心扉，愤怒中带喘息绝望。",
      "emotion": "极度痛苦愤怒转为喘息绝望催促",
      "action": "（皇帝庞大的身躯在沙发残骸上剧烈颤抖，粗大的右爪死死捂住鲜血淋漓的左眼，血泊迅速扩大，痛苦地低吼着抬起头，右眼血红死盯跪地的尼尼坎博士片刻后猛转向沉默的玩家，全身鳞片因愤怒而竖起，警报声中喘息咆哮）",
      "content": "见鬼，尼尼坎！你这核辐射的鬼话是蚂蚁的恐吓伎俩！八百年前的隐患？哈！现在它们敢要挟帝国荣耀，我就让洛洛加的铁蹄踏平那些工厂，给多多米一个血淋淋的教训！元帅！即刻执行血洗，别管什么堆芯熔毁——恐龙的荣耀不容玷污！（喘息着右眼死盯玩家）你！沉默的家伙！这是你最后的机会，说出你的高见，否则帝国镇压启动，谁也别想阻拦！",
      "addressing_target": "npc_006",
      "is_scene_finished": false
    },
    {
      "turn": 4,
      "scene_id": 3,
      "turn_in_scene": 2,
      "timestamp": "2025-12-02T14:32:06.929714",
      "thought": "尼尼坎还在啰嗦核隐患的鬼话，完全是蚂蚁的把戏，我已彻底丧失耐心，洛洛加已离场执行血洗，必须咆哮确认命令，推动镇压启动，同时给沉默的玩家最后一线机会，死盯他以等待回应，剧情已趋近预定结局但还未完全结束。",
      "emotion": "痛苦愤怒的喘息绝望",
      "action": "（皇帝庞大的身躯在沙发残骸上痉挛般颤抖，粗大的右爪死死按住彻底失明的左眼，鲜血从爪缝汩汩滴落扩大血泊，全身鳞片因剧痛和怒火竖立，右眼血红中带着绝望死盯跪地的尼尼坎片刻后猛转沉默的玩家，警报刺耳中军队脚步隆隆逼近，痛苦喘息着咆哮）",
      "content": "够了，尼尼坎！你的核鬼话休想动摇帝国荣耀！洛洛加已领命，第一军团铁蹄正踏向蚂蚁工厂——血洗启动，谁也别想阻拦！（喘息转向玩家，右眼死盯）你！沉默的家伙！这是帝国命运的最后一线生机，说出你的高见，否则镇压即刻全面执行，恐龙荣耀将以蚂蚁鲜血铸就！",
      "addressing_target": "everyone",
      "is_scene_finished": false
    }
  ],
  "last_updated": "2025-12-02T14:32:06.929723",
  "total_performances": 7
}